{
  "HorizontalMenu": [
    {
      "id": "menuAbout",
      "title": "about",
      "route": "/",
      "value": "About Me"
    },
    {
      "id": "menuEducation",
      "title": "education",
      "route": "/education",
      "value": "Education"
    },
    {
      "id": "menuExperience",
      "title": "experience",
      "route": "/experience",
      "value": "Experience"
    },
    {
      "id": "menuSkill",
      "title": "skill",
      "route": "/skill",
      "value": "Skills"
    },
    {
      "id": "menuAnimation",
      "title": "animation",
      "route": "/animation",
      "value": "Animations"
    },
    {
      "id": "recommendations",
      "title": "recommendations",
      "route": "#recommendations",
      "value": "Recommendations"
    }
  ],
  "HomeBanner": {
    "CallToAction": "Contact Me",
    "CallToActionResume": "Resume",
    "Profession": "Web Developer",
    "PhoneNumber": "+61416460092",
    "ViewResume": "https://docs.google.com/document/d/1GuF8Cmcnx14_NCsiQX1c5XChN99t3MwE1n1F9QkVNwQ/edit?usp=sharing"
  },
  "InfoCards": {
    "Animation": {
      "PageTitle": "My Animations",
      "NavMessage": "Press or keep the mouse over the image",
      "TextOne": "This section is a galery of my CSS/JS animations, which I've been developing mostly as a hobby. You can either press the animation, or put the mouse over it to play its preview. But, by clicking on its name you can see it fully on my codepen. 😉",
      "TextTwo": "",
      "SectionLength": "7",
      "Sections": [
        {
          "name": "Cooking Kirby",
          "component": "/src/assets/videos/cookingKirby.mp4",
          "reference": "kirbyVid",
          "link": "https://codepen.io/kojji/full/LYdqqjr"
        },
        {
          "name": "Octopiano",
          "component": "/src/assets/videos/octopiano.mp4",
          "reference": "octopianoVid",
          "link": "https://codepen.io/kojji/full/abVxxOQ"
        },
        {
          "name": "Surfing Pikachu",
          "component": "/src/assets/videos/surfing.mp4",
          "reference": "surfingPikachuVid",
          "link": "https://codepen.io/kojji/full/poaYvVL"
        },
        {
          "name": "GSAP outlines rotation",
          "component": "/src/assets/videos/rotating.mp4",
          "reference": "rotatingVid",
          "link": "https://codepen.io/kojji/full/LYdgmdg"
        },
        {
          "name": "GSAP Rotating Squares",
          "component": "/src/assets/videos/squares.mp4",
          "reference": "squaresVid",
          "link": "https://codepen.io/kojji/full/poLxrMW"
        },
        {
          "name": "Beach Waves",
          "component": "/src/assets/videos/shortVer.mp4",
          "reference": "beachVid",
          "link": "https://codepen.io/kojji/full/QWOJJGQ"
        },
        {
          "name": "City Lights",
          "component": "/src/assets/videos/city_lights.mp4",
          "reference": "cityLightsVid",
          "link": "https://codepen.io/kojji/full/zYPyPJV"
        }
      ]
    },
    "Education": {
      "PageTitle": "Education",
      "Sections": [
        {
          "title": "education",
          "value": "Education Background",
          "length" : "3",
          "items": [
            {
              "title": "ECAC",
              "valueMenu": "2024 - [Diploma] ECAC",
              "valueLabel": "2023 ~ 2024 - [Information Technology] ECA College",
              "valueDescription": "Currently doing the Vocational Course 'Diploma in Information Technology' on ECA College Brisbane, with expected conclusion in 2024."
            },
            {
              "title": "ufgd",
              "valueMenu": "2021 - [Diploma] UFGD",
              "valueLabel": "2021 - [Computer Engineering] UFGD",
              "valueDescription": "Degree obtained by concluding the Computer Engineering course at <i>Universidade Federal da Grande Dourados</i> (UFGD). As course conclusion critereas, I've done an intership at Dourasoft, and for the final paper, I've developed a system to collect data from the soil, which is based on networking multiple wireless sensor nodes, named Agriv with another student."
            },
            {
              "title": "ifsp",
              "valueMenu": "2013 - [Diploma] IFSP-SP",
              "valueLabel": "2013 - [Electronics Technician] IFSP-SP",
              "valueDescription": "Degree obtained by concluding the Electonics Technician integrated with High School course at <i>Instituto Federal de Educação, Ciência e Tecnologia de São Paulo, Campus São Paulo</i> (IFSP-SP). As course conclusion critereas, I've done an intership at Aureon, and with other students, we developed a digital door lock system for the final paper."
            }
          ]
        },
        {
          "title": "certification",
          "value": "Certifications",
          "length" : "3",
          "items": [
            {
              "title": "ccp",
              "valueMenu": "2022 - [CCP] AWS",
              "valueLabel": "2022 - [Certified Cloud Practitioner (CCP)] AWS",
              "valueDescription": "Amazon Web Services (AWS) certification regarding passing grade at Certified Cloud Practitioner (CCP) examination."
            },
            {
              "title": "cae",
              "valueMenu": "2018 - [CAE] Cambrigde",
              "valueLabel": "2018 - [Certificate in Advanced English (CAE)] Cambrigde English",
              "valueDescription": "Certification regarding the score of 193 at Cambridge's Certificate in Advanced English (CAE) examination, equivalent to CEFR's C1 Level."
            },
            {
              "title": "fce",
              "valueMenu": "2017 - [FCE] Cambrigde",
              "valueLabel": "2017 - [First Certificate in English (FCE)] Cambrigde English",
              "valueDescription": "Certification regarding the score of 183 at Cambridge's First Certificate in English (FCE) examination, equivalent to CEFR's C1 Level."
            }
          ]
        },
        {
          "title": "online courses",
          "value": "Online Courses",
          "length" : "0",
          "items": []
        }
      ]
    },
    "Experience": {
      "PageTitle": "Professional Experience",
      "Sections": [
        {
          "title": "paid",
          "value": "Programming Services",
          "length" : "5",
          "items": [
            {
              "title": "mutant",
              "valueMenu": "2022 - Mutant & Vivo",
              "valueLabel": "May. 2022 ~ Sep. 2022 - [Junior Development Analyst] Mutant - Vivo",
              "valueDescription": "Employed by Mutant, I was allocated to work for Vivo. The job consisted of the <b>development and maintenance of use case dialogs</b> for Aura, the company's AI, in the context of customer service via WhatsApp. I deepened my <b>knowledge of Agile Methodologies, typescript, use of javascript classes and npm packages development</b>."
            },
            {
              "title": "rifaisso",
              "valueMenu": "2022 - Rifaisso",
              "valueLabel": "Mar. 2022 ~ May. 2022 - [Freelance] Rifaisso",
              "valueDescription": "I fully <b>developed an API</b> for Rifaisso, from its beginning to the first commercial version. It was <b>developed using Typescript with AdonisJs and docker</b>. During the development, I <b>integrated the <i>Mercado Pago</i> API, made CRON routines, and learned AdonisJs and Docker implementation</b>, which I was not familiar with."
            },
            {
              "title": "teachlearn",
              "valueMenu": "2021 - TeachLearn",
              "valueLabel": "Jan. 2021 ~ Jul. 2021 - [Freelance] TeachLearn",
              "valueDescription": "I took part into the development of TeachLearn's first versions, made in <b>Vue.js with Quasar and Node.js with Express.js</b>. My tasks involved both, front end and back end development, but most of them were on the <b>development of endpoints</b>. One of my most notorious activities at this service, was the <b>development and implementation of a chat system with socket.io</b>."
            },
            {
              "title": "dourasoftFree",
              "valueMenu": "2020 - DouraSoft",
              "valueLabel": "Nov. 2019 ~ Apr. 2020 - [Freelance] DouraSoft",
              "valueDescription": "After my Computer Engineering mandatory internship, I did some services as a Freelancer at Dourasoft. I <b>developed and integrated a Whatsapp bot made with Java and selenium</b> into the company's commercialised system. I also created a <b>SQL script for the database migration</b> from their desktop legacy system to their current web app system."
            },
            {
              "title": "dourasoftIntern",
              "valueMenu": "2019 - DouraSoft",
              "valueLabel": "Feb. 2019 ~ Jun. 2019 - [Internship] DouraSoft",
              "valueDescription": "To conclude my Computer Engineering course, I did my mandatory internship at Dourasoft, where I developed an OCR functionality to be integrated into company's developed and commercialised system. It was done with <b>Amazon Textract (OCR)</b>. During the internship, <b>Vue.js with Quasar, PHP with CakePHP, PostgreSQL, Google Cloud Services and Firebase skills</b> were also learned."
            }
          ]
        },
        {
          "title": "other",
          "value": "Other Projects",
          "length" : "5",
          "items": [
            {
              "title": "protfolio-two",
              "valueMenu": "2022 - portfolio-two",
              "valueLabel": "2022 - portfolio-two (this page)",
              "valueDescription": "<a href=\"https://github.com/Kojji/portfolio-two\" target=\"_blank\"><span style=\"color:blue;font-weight:bold\">[Project available on GitHub]</span></a> This project regards the development of this version of my professional portfolio, made in <b>Vue.js with tailwind, hosted on AWS, and animations made with Green Sock (GSAP)</b>."
            },
            {
              "title": "myCrurriculum",
              "valueMenu": "2022 - MyCurriculum",
              "valueLabel": "2022 - MyCurriculum",
              "valueDescription": "<a href=\"https://github.com/Kojji/my-curriculum\" target=\"_blank\"><span style=\"color:blue;font-weight:bold\">[Project available on GitHub]</span></a> Preview available at <a href=\"https://portfolio-232.web.app\" target=\"_blank\"><span style=\"color:blue;font-weight:bold\">portfolio-232.web.app</span></a>, this project was the first version of this portfolio. At that time, I had set some extras challenges for me, like using <b>Vue.js with bootstrap</b>, which I haven't used previously, and the <b>development of a CSS animation</b> exclusively for the page."
            },
            {
              "title": "cadastrare",
              "valueMenu": "2021 - Cadastrare",
              "valueLabel": "2021 - Cadastrare",
              "valueDescription": "<a href=\"https://github.com/Kojji/sistema-cadastro-consultorio\" target=\"_blank\"><span style=\"color:blue;font-weight:bold\">[Project available on GitHub]</span></a> In this project I developed a web app to manage the agenda and pacient's files of a dental clinic. Developed with <b>Vue.js with Quasar and Express.js</b>. In terms of experience, this project was important for introducing me to the procedures on how to <b>acquire domains and hosting servers on Ubuntu command line</b>."
            },
            {
              "title": "agriv",
              "valueMenu": "2021 - Agriv",
              "valueLabel": "2020 ~ 2021 - Agriv",
              "valueDescription": "Agriv is a system to collect soil data through a Wireless Sensor Network, developed for the final paper of my Computer Engineering course. Made with another student, my role was to <b>develop the network and put together all the hardware</b>. <b>ESPs 32</b> were used as gateways and nodes connected to soil sensors to send data to the system's server. This system is composed of the sensor network and a web app to manage it and view the collected data."
            },
            {
              "title": "passremind",
              "valueMenu": "2020 - PassRemind",
              "valueLabel": "2020 - PassRemind",
              "valueDescription": "<a href=\"https://github.com/Kojji/pass-remind-web-app\" target=\"_blank\"><span style=\"color:blue;font-weight:bold\">[Project available on GitHub]</span></a> PassRemind is a password manager web app for personal use, it was developed using <b>Vue.js with Vuetify and firebase</b>, plus, a <b>browser plugin was developed</b> as well. Although, it is not a complex system, this project had its importance for introducing me to the development of browser plugins and the use of <b>Firebase Functions and Firebase Hosting</b>."
            }
          ]
        },
        {
          "title": "misc",
          "value": "Miscellanious",
          "length" : "2",
          "items": [
            {
              "title": "coin",
              "valueMenu": "2016 - UFGD-COIN",
              "valueLabel": "Mar. 2016 ~ Jul. 2016 - [Internship] UFGD-COIN",
              "valueDescription": "During college, I've done an extracurricular internship at COIN - <i>Coordenadoria de Informática da UFGD</i> (UFGD's IT department), in <b>helpdesk</b>, where most activities envolved assisting faculty and staff with internet and intranet connection problems and computer problems."
            },
            {
              "title": "aureon",
              "valueMenu": "2013 - Aureon",
              "valueLabel": "Apr. 2013 ~ Aug. 2013 - [Internship] Aureon",
              "valueDescription": "To conclude my Electronics Technician course, I did an internship at Aureon, a company that, at the time, commercialized and manufactured analog emergency lightning systems. There, I've calibrated and fixed products on the production line."
            }
          ]
        }
      ]
    },
    "Personal": {
      "PageTitle": "About Me",
      "Paragraphs": [
        "Hi, I'm Fernando. Graduated in Computer Engineering, I'm a web developer. Working mostly as a back end developer. I've already worked as a full stack web developer and, in some other projects, either in front end or back end development, which can be seen on the <b>\"Experience\"</b> tab. My main development stack is composed of Vue.js, Node.js, Typescript and AWS Services, but I've acquired knowledge in other concepts and technologies. To read a more detailed description of what I know, you can go straight to the <b>\"Skills\"</b> tab.",
        "In terms of web development, my biggest interests are <b>API development and CSS/JS animations</b>. Sadly, I still don't have the skillset to completely make the animations I envision. But one day I'll get there. Spite the fact that I've acquired some API development experience, I know there is a lot of room for improvement, mainly at this profession, which requires constant growth. Although, I do believe I have the more than enough potencial and persistance to learn whatever is needed.",
        "A bunch of information about my capabilities and previous expeciences can be found in this page. Anyhow, there are <b>links in the footer</b>, which you can use to either get to know me better, or to get in touch with me. Hope you enjoy this personal page. 😁"
      ]
    },
    "Skills": {
      "PageTitle": "Skills",
      "Paragraphs": [
        "The card on the left is there to provide a more straight display of my main skills, the reading of the beneath parts and the <b>\"Experience\"</b> tab are complementary to each other, giving a little more understanding of my capabilities and current knowledge.",
        "In terms of API development, I've had professional experience using PHP with Cake PHP, but ever since that, I've been using <b>Node.js with Express.js or AdonisJs, and typescript</b>. Unfortunately, I'm not very familiar to automated testing on a professional environment, but I've started studying about unit testing and Ent-to-End testing. Besides that, I've acquired some other skills, for example, <b>usage of sockets; conteiners; cloud services like firebase, GCP and AWS; and creation of linux based web servers</b> from previous experiences.",
        "About front end development, I'm more knowledgeable about <b>Vue.js with some component frameworks such as Quasar, Vuetify, Bootstrap and Tailwind</b>. Due to previous expereiences, I've also learned <b>vanilla HTML, Javascript and CSS</b>.",
        "At the moment, in my spare time, <b>I've been aiming to acquire more knowledge on CSS and JS animations, creation and manipulation of SVGs, automated testing and AWS cloud architecturing</b>."
      ],
      "CardOne": "Main"
    }
  },
  "Recommendations": {
    "SectionLength": 1,
    "Items": [
      {
        "author": "Name",
        "link": "URL",
        "Content": "Content"
      }
    ]
  }
}